package util;

import java.time.LocalDateTime;

/**
 * Βοηθητική κλάση για τη λήψη της ημερομηνίας και ώρας του συστήματος.
 * Η κλάση επιτρέπει να υποκατασταθεί η ημερομηνία/ώρα του συστήματος με μία
 * προκαθορισμένη ημερομηνία/ώρα. Η δυνατότητα αυτή
 * είναι ιδιαίτερη χρήσιμη για την εκτέλεση αυτόματων ελέγχων.
 * @author Νίκος Διαμαντίδης
 *
 */
public class SystemDateTime {

    /**
     * Απαγορεύουμε τη δημιουργία αντικείμενων.
     */
    protected SystemDateTime() { }

    private static LocalDateTime stub;


    /**
     * Θέτει μία συγκεκριμένη ημερομηνία/ώρα ως την ημερομηνία/ώρα του συστήματος.
     * Η ημερομηνία/ώρα αυτή επιστρέφεται από την {@link SystemDateTime#now()}.
     * Εάν αντί για προκαθορισμένης ημερομηνίας/ώρας τεθεί
     * {@code null} τότε επιστρέφεται
     * η πραγματική ημερομηνία/ώρα του συστήματος
     * @param stubDate Η ημερομηνία/ώρα η οποία θα επιστρέφεται
     * ως ημερομηνία/ώρα του συστήματος ή {@code null} για
     * να επιστρέφει την πραγματική ημερομηνία/ώρα
     */
    public static void setStub(LocalDateTime stubDate) {
        stub = stubDate;
    }

    /**
     * Απομακρύνει το στέλεχος.
     */
    protected static void removeStub() {
        stub = null;
    }

    /**
     * Επιστρέφει την ημερομηνία/ώρα του συστήματος ή μία
     * προκαθορισμένη ημερομηνία/ώρα που έχει
     * τεθεί από την {@link SystemDateTime#setStub}.
     * @return Η ημερομηνία/ώρα του συστήματος ή μία προκαθορισμένη ημερομηνία/ώρα
     */
    public static LocalDateTime now() {
        return stub == null ? LocalDateTime.now() : stub;
    }
}
